examples/lidDrivenCavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          5e-3;

writeControl    adjustableRunTime;

writeInterval   0.2;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

runTimeModifiable true;

adjustTimeStep  on;

maxCo           0.1;

functions
{
    #includeFunc fieldAverage(p, U)
    #includeFunc residuals(p, U)

    #includeFunc graphCell
    (
        funcName=xProfile,
        U, UMean,
        axis=distance,
        start=(0.05 0 0),
        end=(0.05 0.1 0)
    )

    #includeFunc cutPlaneSurface
    (
        funcName=asciiPlane,
        point=(0 0 0),
        normal=(0 0 -1),
        interpolation=false,
        p, U
    )
    #includeFunc cutPlaneSurface
    (
        funcName=binaryPlane,
        point=(0 0 0),
        normal=(0 0 -1),
        interpolation=false,
        writeFormat=binary,
        p, U
    )
}


// ************************************************************************* //
